package classwork26;

/* # git init - создание пустого локального репозитория.
   # git status - проверка состояния файлов.
   # git add - добавление изменения в список потенцильно новой версии (комита), говоря иначе: добавление изменения
               (изменение файла, его удаление или создание) в корзину (индекс) изменений.
   # git commit - фиксирование корзины (индекса) изменений как новой версии в истории
   # git log - отображение истории

Если у вас уже существует проект (например проект с домашками), то делаем так:

1. инициализируем локальный репозиторий в этом проект (git init находясь в папке проекта)
2. добавляете все нужные в индекс изменений и делаете коммит
3. создаете пустой репозиторий на гитхабе (задать только название, остальное оставить как есть)
4. скопировать три команды из блока "…or push an existing repository from the command line"
5. выполнить эти три команды

Как загрузить новые изменения на гитхаб:

1. git add lesson_26
2. git commit -m "added lesson 26"
3. git push
*/
public class Classwork26 {
}
