package classwork25;
/*
git log: Эта команда позволяет вам просматривать историю коммитов в вашем репозитории Git.
Когда вы запускаете git log, Git покажет вам список всех коммитов в репозитории
в обратном хронологическом порядке (самый последний коммит будет вверху списка).
Каждый коммит включает в себя информацию, такую как хеш коммита, автор, дату и время коммита, и сообщение коммита.

Пример использования:
git log
git clone: Эта команда используется для создания копии удаленного репозитория Git на вашем локальном компьютере.
Когда вы выполняете git clone, Git создает локальную копию репозитория со всей его историей коммитов, ветками и файлами.
По умолчанию, git clone также настраивает удаленный репозиторий под именем "origin", чтобы вы могли взаимодействовать с ним.

Пример использования:
git clone <URL_удаленного_репозитория>
Где <URL_удаленного_репозитория> представляет собой адрес URL вашего удаленного репозитория Git.


# git init - создание пустого локального репозитория.
        # git status - проверка состояния файлов.
# git add - добавление изменения в список потенцильно новой версии (комита),
говоря иначе: добавление изменения (изменение файла, его удаление или создание)
в корзину (индекс) изменений.
        # git commit - фиксирование корзины (индекса) изменений как новой версии в истории
# git log - отображение истории
 */


public class GitKomanden {
}
