package homework;
       /* // Код символа кленового листа
            char mapleLeaf = '\u1F342';
        // Код символа листа клена
           char mapleLeafAlt = '\u1F341';

        // Код символа общего листа
           char leaf = '\u1F343';

        // Вывод символов
        System.out.println("Кленовый лист: " + mapleLeaf);
        System.out.println("Лист клена: " + mapleLeafAlt);
        System.out.println("Общий лист: " + leaf);

       - Шаг 1 - включить Сканнер.
              Scanner scanner = new scanner(System.in); // включаем один раз на свою программу
       - Шаг 2 - написать приглашение пользователю ...
       - Шаг 3 - задать тип и придумать название переменной, куда принять этот ввод.
        */

// Задача 4.(*) Написать приложение - калькулятор для работы с целыми числами:
// oper == 1 => +, oper == 2 => -, oper == 3 => *, oper == 4 => /, oper == 5 => % ,
// other print "Wrong operation".

public class Calculator {
    public static void main(String[] args) {
// Код символа кленового листа
        String mapleLeaf = "\uD83C\uDF42";

        // Код символа листа клена
        String mapleLeafAlt = "\uD83C\uDF41";

        // Код символа общего листа
        String leaf = "\uD83C\uDF43";

        // Вывод символов
        System.out.println("Кленовый лист: " + mapleLeaf);
        System.out.println("Лист клена: " + mapleLeafAlt);
        System.out.println("Общий лист: " + leaf);
    }
}
